henji-Guo/LAUNCHXL-F280049C/test/boostxl_3phganinv2_test.c
    /* register XINT1 interrupt function and enable in PIE */
    Interrupt_register(INT_XINT1,&XINT1_ISR);
    Interrupt_enable(INT_XINT1);
}

static void boostxl_3phganiv2_enable(void)
{
    GPIO_writePin(nEnable,0);
}

static void boostxl_3phganiv2_disable(void)
{
    GPIO_writePin(nEnable,1);
}

static void led_gpio_init(void)
{
    /**
     * LED5 Red:
     *      GPIO23 output,pullup and control by CPU1
     */
    GPIO_setPinConfig(GPIO_23_GPIO23);
    GPIO_setQualificationMode(23, GPIO_QUAL_SYNC);
    GPIO_setPadConfig(23, GPIO_PIN_TYPE_PULLUP);
    GPIO_setDirectionMode(23, GPIO_DIR_MODE_OUT);
    GPIO_setMasterCore(23, GPIO_CORE_CPU1);
    GPIO_writePin(23,1);

    /**
     * LED4 Green:
     *      GPIO34 output,pullup and control by CPU1
     */
    GPIO_setPinConfig(GPIO_34_GPIO34);
    GPIO_setQualificationMode(34, GPIO_QUAL_SYNC);
    GPIO_setPadConfig(34, GPIO_PIN_TYPE_PULLUP);
    GPIO_setDirectionMode(34, GPIO_DIR_MODE_OUT);
    GPIO_setMasterCore(34, GPIO_CORE_CPU1);
    GPIO_writePin(34,1);

    /**
     * LED YELLOW:
     *      GPIO25 output,pullup and control by CPU1
     */
    GPIO_setPinConfig(GPIO_25_GPIO25);
    GPIO_setQualificationMode(25, GPIO_QUAL_SYNC);
    GPIO_setPadConfig(25, GPIO_PIN_TYPE_PULLUP);
    GPIO_setDirectionMode(25, GPIO_DIR_MODE_OUT);
    GPIO_setMasterCore(25, GPIO_CORE_CPU1);
    GPIO_writePin(25,1);
}

static void led(BOARD_LED led,LED_STATUS status)
{
    switch (status) {
        case LED_ON: 
            GPIO_writePin(led,LED_ON);
            break;
        case LED_OFF: 
            GPIO_writePin(led,LED_OFF);
            break;
        case LED_TOGGLE: 
            GPIO_togglePin(led);
            break;
        default:
            break;
    }
}

static void timer_0_init(void)
{
    /**
     *  CPUTIMER0 :
     *      TIM0_CLK 1MHz SYS_CLK/(99+1)
     */
    /* stop */
    CPUTimer_stopTimer(CPUTIMER0_BASE);

    /* */
    CPUTimer_selectClockSource(CPUTIMER0_BASE,CPUTIMER_CLOCK_SOURCE_SYS,CPUTIMER_CLOCK_PRESCALER_1);
    /* set emulation mode*/
    CPUTimer_setEmulationMode(CPUTIMER0_BASE, CPUTIMER_EMULATIONMODE_STOPAFTERNEXTDECREMENT);

    /* set TIM0_CLK 1MHz */
    CPUTimer_setPreScaler(CPUTIMER0_BASE, 99U);

    /* set TIM0 Period 0XFFFF_FFFF */
    CPUTimer_setPeriod(CPUTIMER0_BASE, 0xFFFFFFFF);

    /* enable TIM0 interrupt */
    CPUTimer_enableInterrupt(CPUTIMER0_BASE);

    /* PieVectorTable register */
    // Interrupt_register(INT_TIMER0,&TIMER0_ISR);

    /* PIE enable */
    // Interrupt_enable(INT_TIMER0);

    /* reload TIM0 counter */
    CPUTimer_reloadTimerCounter(CPUTIMER0_BASE);

    /* start TIM0 */
    CPUTimer_startTimer(CPUTIMER0_BASE);

}

static void epwm_gpio_mux(void)
{

    /*
     *  EPWM1AB GPIO MUX:
     *      GPIO0 --> EPWM1A
     *      GPIO1 --> EPWM1B
     *      Controller By CPU
     *      Synchronization to SYSCLK
     */
    GPIO_setPinConfig(GPIO_0_EPWM1_A);
    GPIO_setPadConfig(0, GPIO_PIN_TYPE_STD);
    GPIO_setQualificationMode(0, GPIO_QUAL_SYNC);
    GPIO_setControllerCore(0, GPIO_CORE_CPU1);

    GPIO_setPinConfig(GPIO_1_EPWM1_B);
    GPIO_setPadConfig(1, GPIO_PIN_TYPE_STD);
    GPIO_setQualificationMode(1, GPIO_QUAL_SYNC);
    GPIO_setControllerCore(1, GPIO_CORE_CPU1);

    /*
     *  EPWM4AB GPIO MUX:
     *      GPIO6 --> EPWM4A
     *      GPIO7 --> EPWM4B
     *      Controller By CPU
     *      Synchronization to SYSCLK
     */
    GPIO_setPinConfig(GPIO_6_EPWM4_A);
    GPIO_setPadConfig(6, GPIO_PIN_TYPE_STD);
    GPIO_setQualificationMode(6, GPIO_QUAL_SYNC);
    GPIO_setControllerCore(6, GPIO_CORE_CPU1);

    GPIO_setPinConfig(GPIO_7_EPWM4_B);
    GPIO_setPadConfig(7, GPIO_PIN_TYPE_STD);
    GPIO_setQualificationMode(7, GPIO_QUAL_SYNC);
    GPIO_setControllerCore(7, GPIO_CORE_CPU1);

    /*
     *  EPWM2AB GPIO MUX:
     *      GPIO2 --> EPWM2A
     *      GPIO3 --> EPWM2B
     *      Controller By CPU
     *      Synchronization to SYSCLK
     */
    GPIO_setPinConfig(GPIO_2_EPWM2_A);
    GPIO_setPadConfig(2, GPIO_PIN_TYPE_STD);
    GPIO_setQualificationMode(2, GPIO_QUAL_SYNC);
    GPIO_setControllerCore(2, GPIO_CORE_CPU1);

    GPIO_setPinConfig(GPIO_3_EPWM2_B);
    GPIO_setPadConfig(3, GPIO_PIN_TYPE_STD);
    GPIO_setQualificationMode(3, GPIO_QUAL_SYNC);
    GPIO_setControllerCore(3, GPIO_CORE_CPU1);
}

static void epwm_1_init(void)
{
    /*
     *  EPWM1AB:
     *      frequency USER_CONTROL_FREQ
     *      active high complementary
     *      dead-band 1us
     *      trigger ADC SOCx event
     */

//    /* clock disable */
//    SysCtl_disablePeripheral(SYSCTL_PERIPH_CLK_EPWM1);
//    /* enable clock*/
//    SysCtl_enablePeripheral(SYSCTL_PERIPH_CLK_EPWM1);

    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_EPWM1);
    /* TBCLK:100MHz/(EPWM_ClockDivider*EPWM_HSClockDivider) ; TBPRD:TBCLK/(2*PWM_CLK)) in up and down mode */
    EPWM_setClockPrescaler(EPWM1_BASE, EPWM_CLOCK_DIVIDER_1, EPWM_HSCLOCK_DIVIDER_1);
    EPWM_setTimeBasePeriod(EPWM1_BASE, EPWM_PERIOD);
    EPWM_setTimeBaseCounter(EPWM1_BASE, 0);

    /* TB counter mode: EPWM_COUNTER_MODE_UP_DOWN */
    EPWM_setTimeBaseCounterMode(EPWM1_BASE, EPWM_COUNTER_MODE_UP_DOWN);

    /* No Phase Shift */
    EPWM_disablePhaseShiftLoad(EPWM1_BASE);
    EPWM_setPhaseShift(EPWM1_BASE, 0);

    /* SYNC OUT: EPWM_SYNC_OUT_PULSE_DISABLED*/
    EPWM_setSyncOutPulseMode(EPWM1_BASE, EPWM_SYNC_OUT_PULSE_DISABLED);

    /* Action Qualifier: zero ⬇, period x, CMPA up ⬆, CMPA down ⬇, CMPB x, T1/T2 x */
    EPWM_setCounterCompareShadowLoadMode(EPWM1_BASE, EPWM_COUNTER_COMPARE_A,EPWM_COMP_LOAD_ON_CNTR_ZERO);
    EPWM_setCounterCompareValue(EPWM1_BASE, EPWM_COUNTER_COMPARE_A, EPWM_PERIOD * 0.5);

    EPWM_setActionQualifierAction(EPWM1_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_LOW, EPWM_AQ_OUTPUT_ON_TIMEBASE_ZERO);
    EPWM_setActionQualifierAction(EPWM1_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_TIMEBASE_PERIOD);
    EPWM_setActionQualifierAction(EPWM1_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_HIGH, EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPA);
    EPWM_setActionQualifierAction(EPWM1_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_LOW, EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPA);

