henji-Guo/LAUNCHXL-F280049C/test/boostxl_3phganinv2_test.c
    EPWM_setActionQualifierAction(EPWM1_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPB);
    EPWM_setActionQualifierAction(EPWM1_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPB);
    EPWM_setActionQualifierAction(EPWM1_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T1_COUNT_UP);
    EPWM_setActionQualifierAction(EPWM1_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T1_COUNT_DOWN);
    EPWM_setActionQualifierAction(EPWM1_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T2_COUNT_UP);
    EPWM_setActionQualifierAction(EPWM1_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T2_COUNT_DOWN);

    /* Dead-Band: DB_CLK=TB_CLK=100MHz */
    EPWM_setDeadBandCounterClock(EPWM1_BASE, EPWM_DB_COUNTER_CLOCK_FULL_CYCLE);

    /* set failing polarity inverse */
    EPWM_setDeadBandDelayPolarity(EPWM1_BASE, EPWM_DB_FED,EPWM_DB_POLARITY_ACTIVE_LOW);

    /* enable rising and failing with 1us(100*DB_CLK) dead-band*/
    EPWM_setDeadBandDelayMode(EPWM1_BASE, EPWM_DB_RED, true);
    EPWM_setDeadBandDelayMode(EPWM1_BASE, EPWM_DB_FED, true);
    EPWM_setRisingEdgeDelayCount(EPWM1_BASE, 100U);
    EPWM_setFallingEdgeDelayCount(EPWM1_BASE, 100U);

    /* enable ADC trigger source: EPWM_SOC_A  EPWM_SOC_TBCTR_PERIOD */
    EPWM_enableADCTriggerEventCountInit(EPWM1_BASE, EPWM_SOC_A);
    EPWM_setADCTriggerSource(EPWM1_BASE, EPWM_SOC_A, EPWM_SOC_TBCTR_ZERO);
    EPWM_setADCTriggerEventPrescale(EPWM1_BASE, EPWM_SOC_A, 1);
    EPWM_enableADCTrigger(EPWM1_BASE, EPWM_SOC_A);

    /* set Trip Zone stop EPWM6AB output */
    EPWM_setTripZoneAction(EPWM1_BASE,EPWM_TZ_ACTION_EVENT_TZA,EPWM_TZ_ACTION_LOW);
    EPWM_setTripZoneAction(EPWM1_BASE,EPWM_TZ_ACTION_EVENT_TZB,EPWM_TZ_ACTION_LOW);
}

static void epwm_4_init(void)
{
    /*
     *  EPWM4AB:
     *      frequency USER_CONTROL_FREQ
     *      active high complementary
     *      dead-band 1us
     *      trigger ADC SOCx event
     */

//    /* clock disable */
//    SysCtl_disablePeripheral(SYSCTL_PERIPH_CLK_EPWM4);
//    /* enable clock*/
//    SysCtl_enablePeripheral(SYSCTL_PERIPH_CLK_EPWM4);

    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_EPWM4);
    /* TBCLK:100MHz/(EPWM_ClockDivider*EPWM_HSClockDivider) ; TBPRD:TBCLK/(2*PWM_CLK)) in up and down mode */
    EPWM_setClockPrescaler(EPWM4_BASE, EPWM_CLOCK_DIVIDER_1, EPWM_HSCLOCK_DIVIDER_1);
    EPWM_setTimeBasePeriod(EPWM4_BASE, EPWM_PERIOD);
    EPWM_setTimeBaseCounter(EPWM4_BASE, 0);

    /* TB counter mode: EPWM_COUNTER_MODE_UP_DOWN */
    EPWM_setTimeBaseCounterMode(EPWM4_BASE, EPWM_COUNTER_MODE_UP_DOWN);

    /* No Phase Shift */
    EPWM_disablePhaseShiftLoad(EPWM4_BASE);
    EPWM_setPhaseShift(EPWM4_BASE, 0);

    /* SYNC OUT: EPWM_SYNC_OUT_PULSE_DISABLED*/
    EPWM_setSyncOutPulseMode(EPWM4_BASE, EPWM_SYNC_OUT_PULSE_DISABLED);

    /* Action Qualifier: zero ⬇, period x, CMPA up ⬆, CMPA down ⬇, CMPB x, T1/T2 x */
    EPWM_setCounterCompareShadowLoadMode(EPWM4_BASE, EPWM_COUNTER_COMPARE_A,EPWM_COMP_LOAD_ON_CNTR_ZERO);
    EPWM_setCounterCompareValue(EPWM4_BASE, EPWM_COUNTER_COMPARE_A, EPWM_PERIOD * 0.5);

    EPWM_setActionQualifierAction(EPWM4_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_LOW, EPWM_AQ_OUTPUT_ON_TIMEBASE_ZERO);
    EPWM_setActionQualifierAction(EPWM4_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_TIMEBASE_PERIOD);
    EPWM_setActionQualifierAction(EPWM4_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_HIGH, EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPA);
    EPWM_setActionQualifierAction(EPWM4_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_LOW, EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPA);

    EPWM_setActionQualifierAction(EPWM4_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPB);
    EPWM_setActionQualifierAction(EPWM4_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPB);
    EPWM_setActionQualifierAction(EPWM4_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T1_COUNT_UP);
    EPWM_setActionQualifierAction(EPWM4_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T1_COUNT_DOWN);
    EPWM_setActionQualifierAction(EPWM4_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T2_COUNT_UP);
    EPWM_setActionQualifierAction(EPWM4_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T2_COUNT_DOWN);

    /* Dead-Band: DB_CLK=TB_CLK=100MHz */
    EPWM_setDeadBandCounterClock(EPWM4_BASE, EPWM_DB_COUNTER_CLOCK_FULL_CYCLE);

    /* set failing polarity inverse */
    EPWM_setDeadBandDelayPolarity(EPWM4_BASE, EPWM_DB_FED,EPWM_DB_POLARITY_ACTIVE_LOW);

    /* enable rising and failing with 1us(100*DB_CLK) dead-band*/
    EPWM_setDeadBandDelayMode(EPWM4_BASE, EPWM_DB_RED, true);
    EPWM_setDeadBandDelayMode(EPWM4_BASE, EPWM_DB_FED, true);
    EPWM_setRisingEdgeDelayCount(EPWM4_BASE, 100U);
    EPWM_setFallingEdgeDelayCount(EPWM4_BASE, 100U);

    /* enable ADC trigger source: EPWM_SOC_A  EPWM_SOC_TBCTR_PERIOD */
    // EPWM_enableADCTriggerEventCountInit(EPWM4_BASE, EPWM_SOC_A);
    // EPWM_setADCTriggerSource(EPWM4_BASE, EPWM_SOC_A, EPWM_SOC_TBCTR_ZERO);
    // EPWM_setADCTriggerEventPrescale(EPWM4_BASE, EPWM_SOC_A, 1);
    // EPWM_enableADCTrigger(EPWM4_BASE, EPWM_SOC_A);

    /* set Trip Zone stop EPWM6AB output */
    EPWM_setTripZoneAction(EPWM4_BASE,EPWM_TZ_ACTION_EVENT_TZA,EPWM_TZ_ACTION_LOW);
    EPWM_setTripZoneAction(EPWM4_BASE,EPWM_TZ_ACTION_EVENT_TZB,EPWM_TZ_ACTION_LOW);
}

static void epwm_2_init(void)
{
    /*
     *  EPWM2AB:
     *      frequency USER_CONTROL_FREQ
     *      active high complementary
     *      dead-band 1us
     *      trigger ADC SOCx event
     */

//    /* clock disable */
//    SysCtl_disablePeripheral(SYSCTL_PERIPH_CLK_EPWM2);
//    /* enable clock*/
//    SysCtl_enablePeripheral(SYSCTL_PERIPH_CLK_EPWM2);

    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_EPWM2);
    /* TBCLK:100MHz/(EPWM_ClockDivider*EPWM_HSClockDivider) ; TBPRD:TBCLK/(2*PWM_CLK)) in up and down mode */
    EPWM_setClockPrescaler(EPWM2_BASE, EPWM_CLOCK_DIVIDER_1, EPWM_HSCLOCK_DIVIDER_1);
    EPWM_setTimeBasePeriod(EPWM2_BASE, EPWM_PERIOD);
    EPWM_setTimeBaseCounter(EPWM2_BASE, 0);

    /* TB counter mode: EPWM_COUNTER_MODE_UP_DOWN */
    EPWM_setTimeBaseCounterMode(EPWM2_BASE, EPWM_COUNTER_MODE_UP_DOWN);

