henji-Guo/LAUNCHXL-F280049C/test/boostxl_3phganinv2_test.c
    /* No Phase Shift */
    EPWM_disablePhaseShiftLoad(EPWM2_BASE);
    EPWM_setPhaseShift(EPWM2_BASE, 0);

    /* SYNC OUT: EPWM_SYNC_OUT_PULSE_DISABLED*/
    EPWM_setSyncOutPulseMode(EPWM2_BASE, EPWM_SYNC_OUT_PULSE_DISABLED);

    /* Action Qualifier: zero ⬇, period x, CMPA up ⬆, CMPA down ⬇, CMPB x, T1/T2 x */
    EPWM_setCounterCompareShadowLoadMode(EPWM2_BASE, EPWM_COUNTER_COMPARE_A,EPWM_COMP_LOAD_ON_CNTR_ZERO);
    EPWM_setCounterCompareValue(EPWM2_BASE, EPWM_COUNTER_COMPARE_A, EPWM_PERIOD * 0.5);

    EPWM_setActionQualifierAction(EPWM2_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_LOW, EPWM_AQ_OUTPUT_ON_TIMEBASE_ZERO);
    EPWM_setActionQualifierAction(EPWM2_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_TIMEBASE_PERIOD);
    EPWM_setActionQualifierAction(EPWM2_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_HIGH, EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPA);
    EPWM_setActionQualifierAction(EPWM2_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_LOW, EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPA);

    EPWM_setActionQualifierAction(EPWM2_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPB);
    EPWM_setActionQualifierAction(EPWM2_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPB);
    EPWM_setActionQualifierAction(EPWM2_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T1_COUNT_UP);
    EPWM_setActionQualifierAction(EPWM2_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T1_COUNT_DOWN);
    EPWM_setActionQualifierAction(EPWM2_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T2_COUNT_UP);
    EPWM_setActionQualifierAction(EPWM2_BASE, EPWM_AQ_OUTPUT_A, EPWM_AQ_OUTPUT_NO_CHANGE, EPWM_AQ_OUTPUT_ON_T2_COUNT_DOWN);

    /* Dead-Band: DB_CLK=TB_CLK=100MHz */
    EPWM_setDeadBandCounterClock(EPWM2_BASE, EPWM_DB_COUNTER_CLOCK_FULL_CYCLE);

    /* set failing polarity inverse */
    EPWM_setDeadBandDelayPolarity(EPWM2_BASE, EPWM_DB_FED,EPWM_DB_POLARITY_ACTIVE_LOW);

    /* enable rising and failing with 1us(100*DB_CLK) dead-band*/
    EPWM_setDeadBandDelayMode(EPWM2_BASE, EPWM_DB_RED, true);
    EPWM_setDeadBandDelayMode(EPWM2_BASE, EPWM_DB_FED, true);
    EPWM_setRisingEdgeDelayCount(EPWM2_BASE, 100U);
    EPWM_setFallingEdgeDelayCount(EPWM2_BASE, 100U);

    /* enable ADC trigger source: EPWM_SOC_A  EPWM_SOC_TBCTR_PERIOD */
    // EPWM_enableADCTriggerEventCountInit(EPWM2_BASE, EPWM_SOC_A);
    // EPWM_setADCTriggerSource(EPWM2_BASE, EPWM_SOC_A, EPWM_SOC_TBCTR_ZERO);
    // EPWM_setADCTriggerEventPrescale(EPWM2_BASE, EPWM_SOC_A, 1);
    // EPWM_enableADCTrigger(EPWM2_BASE, EPWM_SOC_A);

    /* set Trip Zone stop EPWM6AB output */
    EPWM_setTripZoneAction(EPWM2_BASE,EPWM_TZ_ACTION_EVENT_TZA,EPWM_TZ_ACTION_LOW);
    EPWM_setTripZoneAction(EPWM2_BASE,EPWM_TZ_ACTION_EVENT_TZB,EPWM_TZ_ACTION_LOW);
}

static void pwm_setDuty(uint16_t Ua, uint16_t Ub, uint16_t Uc)
{
    EPWM_setCounterCompareValue(EPWM1_BASE, EPWM_COUNTER_COMPARE_A, Ua);
    EPWM_setCounterCompareValue(EPWM4_BASE, EPWM_COUNTER_COMPARE_A, Ub);
    EPWM_setCounterCompareValue(EPWM2_BASE, EPWM_COUNTER_COMPARE_A, Uc);
}

static void analog_subsys_init(void)
{
    /**
     * analog subsystem init:
     *      using internal voltage reference 3.3V(2*1.65)
     */
    SysCtl_delay(50);
    ASysCtl_setAnalogReferenceInternal(ASYSCTL_VREFHIA | ASYSCTL_VREFHIB | ASYSCTL_VREFHIC);
    ASysCtl_setAnalogReference1P65(ASYSCTL_VREFHIA | ASYSCTL_VREFHIB | ASYSCTL_VREFHIC);
    SysCtl_delay(50);
}

static void adc_a_init(void)
{
    /**
     *  ADCA：ADC_CLK 50MHz, 3.3V reference voltage, Acquisition window duration at least 75ns (8*SYS_CLK)
     *      name |      input pin     | soc number | trigger source | interrupt number |
     * J7_63 Udc |       ADCINA6      |    SOC 6   |   EPWM1_SOCA   |
     * J7_69 Ic  |       ADCINA3      |    SOC 5   |   EPWM1_SOCA   |
     */
    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_ADCA);

    /* disable */
    ADC_disableConverter(ADCA_BASE);

    /* set ADC voltage reference internal 3.3V*/
    ADC_setVREF(ADCA_BASE, ADC_REFERENCE_INTERNAL, ADC_REFERENCE_3_3V);

    /* set prescaler ADC_CLK = 100MHz/2 =50MHz */
    ADC_setPrescaler(ADCA_BASE, ADC_CLK_DIV_2_0);

    /* set the timing of the end-of-conversion pulse */
    ADC_setInterruptPulseMode(ADCA_BASE, ADC_PULSE_END_OF_CONV);

    /* set soc number priority */
    ADC_setSOCPriority(ADCA_BASE,ADC_PRI_ALL_HIPRI);

    /* ADCINA6 SOC6, no interrupt trigger */
    ADC_setupSOC(ADCA_BASE, ADC_SOC_NUMBER6, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN6, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCA_BASE, ADC_SOC_NUMBER6, ADC_INT_SOC_TRIGGER_NONE);

    /* ADCINA3 SOC5, no interrupt trigger */
    ADC_setupSOC(ADCA_BASE, ADC_SOC_NUMBER5, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN3, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCA_BASE, ADC_SOC_NUMBER5, ADC_INT_SOC_TRIGGER_NONE);

    /* enable */
    ADC_enableConverter(ADCA_BASE);

    /* delay 5ms power up*/
    DEVICE_DELAY_US(5000);
}

static void adc_b_init(void)
{
    /**
     *  ADCB：ADC_CLK 50MHz, 3.3V reference voltage, Acquisition window duration at least 75ns (8*SYS_CLK)
     *      name |      input pin     | soc number | trigger source | interrupt number |
     * J7_64 Ua  |       ADCINB6      |    SOC 5   |   EPWM1_SOCA   |
     */
    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_ADCC);

    /* disable */
    ADC_disableConverter(ADCB_BASE);

    /* set ADC voltage reference internal 3.3V*/
    ADC_setVREF(ADCB_BASE, ADC_REFERENCE_INTERNAL, ADC_REFERENCE_3_3V);

    /* set prescaler ADC_CLK = 100MHz/2 =50MHz */
    ADC_setPrescaler(ADCB_BASE, ADC_CLK_DIV_2_0);

    /* set the timing of the end-of-conversion pulse */
    ADC_setInterruptPulseMode(ADCB_BASE, ADC_PULSE_END_OF_CONV);

    /* set soc number priority */
    ADC_setSOCPriority(ADCB_BASE,ADC_PRI_ALL_HIPRI);

    /* ADCINB6  SOC5, no interrupt trigger */
    ADC_setupSOC(ADCB_BASE, ADC_SOC_NUMBER5, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN6, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCB_BASE, ADC_SOC_NUMBER5, ADC_INT_SOC_TRIGGER_NONE);

    /* enable */
    ADC_enableConverter(ADCB_BASE);

    /* delay 5ms power up*/
    DEVICE_DELAY_US(5000);
}

static void adc_c_init(void)
{
    /**
     *  ADCC：ADC_CLK 50MHz, 3.3V reference voltage, Acquisition window duration at least 75ns (8*SYS_CLK)
     *      name |      input pin     | soc number | trigger source | interrupt number |
     * J7_65 Ub  |       ADCINC14     |    SOC 7   |   EPWM6_SOCA   |
     * J7_66 Uc  |       ADCINC1      |    SOC 8   |   EPWM6_SOCA   |
     * J7_67 Ia  |       ADCINC3      |    SOC 5   |   EPWM6_SOCA   |
     * J7_68 Ib  |       ADCINC5      |    SOC 6   |   EPWM6_SOCA   |
     */
    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_ADCC);

    /* disable */
    ADC_disableConverter(ADCC_BASE);

    /* set ADC voltage reference internal 3.3V*/
    ADC_setVREF(ADCC_BASE, ADC_REFERENCE_INTERNAL, ADC_REFERENCE_3_3V);

    /* set prescaler ADC_CLK = 100MHz/2 =50MHz */
    ADC_setPrescaler(ADCC_BASE, ADC_CLK_DIV_2_0);

