henji-Guo/LAUNCHXL-F280049C/test/boostxl_3phganinv2_test.c
    /* set the timing of the end-of-conversion pulse */
    ADC_setInterruptPulseMode(ADCC_BASE, ADC_PULSE_END_OF_CONV);

    /* set soc number priority */
    ADC_setSOCPriority(ADCC_BASE,ADC_PRI_ALL_HIPRI);

    /* ADCINC3 SOC5, no interrupt trigger */
    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER5, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN3, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER5, ADC_INT_SOC_TRIGGER_NONE);

    /* ADCINC5 SOC6, no interrupt trigger */
    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER6, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN5, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER6, ADC_INT_SOC_TRIGGER_NONE);

    /* ADCINC14 SOC7, no interrupt trigger */
    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER7, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN14, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER7, ADC_INT_SOC_TRIGGER_NONE);

    /* ADCINC1 SOC8, no interrupt trigger */
    ADC_setupSOC(ADCC_BASE, ADC_SOC_NUMBER8, ADC_TRIGGER_EPWM1_SOCA, ADC_CH_ADCIN1, ADC_SAMPLE_WINDOWS);
    ADC_setInterruptSOCTrigger(ADCC_BASE, ADC_SOC_NUMBER8, ADC_INT_SOC_TRIGGER_NONE);

    /* set ADCC_SOC8 EOC using ADCC_INT1 */
    ADC_setInterruptSource(ADCC_BASE, ADC_INT_NUMBER1, ADC_SOC_NUMBER8);

    /* enable interrupt */
    ADC_enableInterrupt(ADCC_BASE, ADC_INT_NUMBER1);

    /* PieVectorTable register */
    Interrupt_register(INT_ADCC1,&ADCC1_ISR);

    /* PIE enable */
    Interrupt_enable(INT_ADCC1);

    /* enable */
    ADC_enableConverter(ADCC_BASE);

    /* delay 5ms power up*/
    DEVICE_DELAY_US(5000);
}

static void i2c_gpio_mux(void)
{
    /*
     *  I2CA GPIO MUX:
     *      GPIO35 --> I2C SDA  (pull up)
     *      GPIO37 --> I2C SCL  (pull up)
     *      Controller By CPU
     *      Asynchronization to SYSCLK
     */
    GPIO_setPinConfig(GPIO_35_I2CA_SDA);
    GPIO_setPadConfig(35, GPIO_PIN_TYPE_PULLUP);
    GPIO_setQualificationMode(35, GPIO_QUAL_ASYNC);
    GPIO_setMasterCore(35, GPIO_CORE_CPU1);

    GPIO_setPinConfig(GPIO_37_I2CA_SCL);
    GPIO_setPadConfig(37, GPIO_PIN_TYPE_PULLUP);
    GPIO_setQualificationMode(37, GPIO_QUAL_ASYNC);
    GPIO_setMasterCore(37, GPIO_CORE_CPU1);
}

static void i2c_a_init(void)
{
    /**
     *  I2CA:
     *      I2CA_CLK: 1MHz
     *      slaver address: 0x36
     *      transfer bit width: 8 bit
     */
    /* reset */
    SysCtl_resetPeripheral(SYSCTL_PERIPH_RES_I2CA);

    /* disable */
    I2C_disableModule(I2CA_BASE);

    /* I2C_CLK 1MHz , Clock reference "TRM 24.1.5 Clock Generation" */
    /* configure I2C Module clock using I2CPSC register I2C Module clock should be 7-12Mhz */
    I2caRegs.I2CPSC.bit.IPSC = 4U;   // I2C_Module_CLK(Fmod) = 100MHz SYSCLK / (ISP = 9 + 1) = 10Mhz
    
    /* configure I2C Baud rate using I2CCLKL and I2CCLKH */
    /* I2C Baud rate = ((I2CCLKL + d)+(I2CCLKH + d))/Fmod = ((5+5)+(5+5))/10MHz = 1/1MHz */
    I2caRegs.I2CCLKL = 5U;
    I2caRegs.I2CCLKH = 5U;
    
    /* config master send mode */
    I2C_setConfig(I2CA_BASE, I2C_CONTROLLER_SEND_MODE);

    /* set slaver address 0x36 */
    I2C_setTargetAddress(I2CA_BASE, 0x36U);

    /* disable loop back mode */
    I2C_disableLoopback(I2CA_BASE);

    /* set bit width 8 bits */
    I2C_setBitCount(I2CA_BASE, I2C_BITCOUNT_8);

    /* set slaver address mode 7 bits address */
    I2C_setAddressMode(I2CA_BASE, I2C_ADDR_MODE_7BITS);

    /* enable FIFO */
    I2C_enableFIFO(I2CA_BASE);

    /* set emulation mode */
    I2C_setEmulationMode(I2CA_BASE, I2C_EMULATION_FREE_RUN);

    /* enable */
    I2C_enableModule(I2CA_BASE);
}

static float as5600_get_angle(void)
{
    // note that this function need cost 54us

    /* temporary variable */
    uint16_t angle[2];

    /* I2C Master TX/RX Flowchat */
    /* I2C Basic configuration */

    // disable I2C ISR=0
    I2caRegs.I2CMDR.bit.IRS = 0;

    // Clock reference "TRM 24.1.5 Clock Generation"
    // Configure I2C Module clock using I2CPSC register I2C Module clock should be 7-12Mhz
    I2caRegs.I2CPSC.bit.IPSC = 4;  // I2C_Module_CLK(Fmod) = 100MHz SYSCLK / (ISP=4 + 1) = 20Mhz

    // Configure I2C Baud rate using I2CCLKL and I2CCLKH
    // I2C Baud rate = (I2CCLKL + d)+(I2CCLKH + d)/Fmod
    I2caRegs.I2CCLKL = 5;
    I2caRegs.I2CCLKH = 5;

    // Configure I2C Own address using I2COAR (no need in master tx/rx mode)
    I2caRegs.I2COAR.bit.OAR = 0x00;

    // Configure I2C Slave address to talk to using I2CSAR
    I2caRegs.I2CSAR.bit.SAR = 0x36;
    /* FIFO mode (16-deep x 8-bit FIFO) */
    /* enable and configure TX/RX FIFO,configure TX/RX FIFO level,if need can enable FIFO interrupts*/
    I2caRegs.I2CFFTX.bit.I2CFFEN = 0x1;
    I2caRegs.I2CFFTX.bit.TXFFRST = 0x1;
    I2caRegs.I2CFFTX.bit.TXFFIL = 0x0;
//    I2caRegs.I2CFFTX.bit.TXFFIENA = 0x1;
    I2caRegs.I2CFFRX.bit.RXFFRST = 0x1;
    I2caRegs.I2CFFRX.bit.RXFFIL = 0x2;
//    I2caRegs.I2CFFRX.bit.RXFFIENA = 0x1;

    /* Application code decides to initiate i2c transaction */
    /* check I2C bus free I2CSTR.BB == 0 */
    while(I2caRegs.I2CSTR.bit.BB);

    /* Master Transmitter MST=1 or Master Receive MST=0 */
    /* Master Transmitter MST=1 */ 
    I2caRegs.I2CMDR.bit.MST = 1;

    /* check Repeat mode RM=1 or No-repeat mode RM=0 */
    /* note that repeat mode don't care I2CNT */
    I2caRegs.I2CMDR.bit.RM = 0;

    /* No-repeat mode */
    /* set I2CCNT number of bytes to be transmitted */
    I2caRegs.I2CCNT = 1;

    /* set I2CMDR */
    I2caRegs.I2CMDR.all = 0x6620;

    /* put data in fifo */
    for (int i = 0; i < 1; i++) {
        /* check TX FIFO is full */
        while(I2caRegs.I2CFFTX.bit.TXFFST == 16);
        I2caRegs.I2CDXR.bit.DATA = 0x0C;
    }

    /* check i2c tx status */
    while(I2caRegs.I2CSTR.bit.XSMT != 1 || I2caRegs.I2CSTR.bit.BYTESENT != 1);
    I2caRegs.I2CSTR.bit.BYTESENT = 1;

    /* check I2CSTR ARDY bit */
    while(I2caRegs.I2CSTR.bit.ARDY != 1);
    I2caRegs.I2CSTR.bit.ARDY = 1;

    /* enter recieve mode */
    /* Master Receive MST=0 */ 
    I2caRegs.I2CMDR.bit.MST = 0;

    /* check Repeat mode RM=1 or No-repeat mode RM=0 */
    /* note that repeat mode don't care I2CNT */
    I2caRegs.I2CMDR.bit.RM = 0;

    /* No-repeat mode */
    /* set I2CCNT number of bytes to be recieved */
    I2caRegs.I2CCNT = 2;

    /* set I2CMDR */
    I2caRegs.I2CMDR.all = 0x6420; // TRM misdescription

    while(I2caRegs.I2CFFRX.bit.RXFFINT != 1);

