henji-Guo/LAUNCHXL-F280049C/test/boostxl_3phganinv2_test.c
    /* put data in fifo */
    for (int i = 0; i < 2; i++) {
        // check TX FIFO is full
        if(I2caRegs.I2CFFRX.bit.RXFFST > 0){
            angle[i] = I2caRegs.I2CDRR.all;
        }
    }

    /* check NACK */ 
    if(I2caRegs.I2CSTR.bit.NACKSNT != 1)
        I2caRegs.I2CMDR.bit.NACKMOD = 1;
    while(I2caRegs.I2CSTR.bit.NACKSNT != 1);
    I2caRegs.I2CSTR.bit.NACKSNT = 1;

    /* send stop */
    I2caRegs.I2CMDR.bit.STP = 1;
    
    /* calculate AS5600 raw value to angle(0,2PI) */
    return ( (angle[0] << 8 | angle[1]) / 4095.0f * 2.0f * M_PI );
}

static void sweep_init(void)
{
    int i;

    for (i = 0; i < SWEEP_SAMPLE_POINT; i++)
        sweep_sample[i] = sinf( (2 * M_PI / SWEEP_SAMPLE_POINT) * i );
}

uint16_t count,index,T=36;
float time;

__interrupt 
static void ADCC1_ISR(void)
{
    /* clear EPWM SOCA flag */
    EPWM_clearADCTriggerFlag(EPWM1_BASE,EPWM_SOC_A);
    /* clear ADCB INT1 flag */
    ADC_clearInterruptStatus(ADCC_BASE, ADC_INT_NUMBER1);
    /* clear PIE FLAG */
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP1);

    /* run foc */
    foc_run(&foc_motor1);

    /* vofa print */
#if 1
    vofa.setData(&vofa,foc_motor1.Speed_ref, 0);
    vofa.setData(&vofa,foc_motor1.motorSpeed, 1);
    vofa.setData(&vofa,foc_motor1.Iq_ref, 2);
    vofa.setData(&vofa,foc_motor1.Iq, 3);
    vofa.setData(&vofa,foc_motor1.Iq_error, 4);
    vofa.setData(&vofa,foc_motor1.Id_ref, 5);
    vofa.setData(&vofa,foc_motor1.Id, 6);
    vofa.setData(&vofa,foc_motor1.Id_error, 7);
#else
    /* sweep function */
    if (index == 256) {
        index = 0;
        if (T > 0)
            T = T - 2;
        else{
            pwm_setDuty(0,0,0);
            boostxl_3phganiv2_disable();
            ESTOP0;
        }
    }

    if(count++ % T != 0)
        return;
    foc_motor1.Iq_ref = sweep_sample[index];
    time += T/40.0f;

    vofa.setData(&vofa,foc_motor1.Iq_ref, 0);
    vofa.setData(&vofa,foc_motor1.Iq, 1);
    vofa.setData(&vofa,foc_motor1.Iq_error, 2);
    vofa.setData(&vofa,foc_motor1.Id_ref, 3);
    vofa.setData(&vofa,foc_motor1.Id, 4);
    vofa.setData(&vofa,foc_motor1.Id_error, 5);
    vofa.setData(&vofa,time, 6);
    vofa.setData(&vofa,sweep_sample[index++], 7);
    vofa.print(&vofa);
#endif
    vofa.print(&vofa);

}

__interrupt
static void XINT1_ISR(void)
{
    if(GPIO_readPin(OT_PIN) == 0){
        boostxl_3phganiv2_disable();
        led(LED_RED,LED_ON);
        while(1);
    }
    /* clear PIE FLAG */
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP1);
}

__interrupt 
static void TIMER0_ISR(void)
{
    /* clear TIM0 flag */
    CPUTimer_clearOverflowFlag(CPUTIMER0_BASE);

    /* clear PIE flag */
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP1);
}


int debug_on;
void boostxl_3phganinv2_test(void)
{

    /* GPIO MUX */
    boostxl_3phganiv2_gpio_mux();
    led_gpio_init();

    /* ANALOG SUBSYS Init*/
    analog_subsys_init();

    /* ADC Init */
    adc_a_init();
    adc_b_init();
    adc_c_init();

    /* TIMER Init */
    timer_0_init();

    /* I2C Init */
    i2c_gpio_mux();
    i2c_a_init();

    /* FOC Init */
    foc_init(&foc_motor1);

    /* VOFA+ Init */
    vofa_init(&vofa);

    /* SWEEP Init */
    sweep_init();
    
    /* enable boostxl-3phganiv2 */
    boostxl_3phganiv2_enable();

    /* EPWM Init */
    /* Must disable the clock to the ePWM modules to have all ePWM modules synchronized */
    SysCtl_disablePeripheral(SYSCTL_PERIPH_CLK_TBCLKSYNC);
    /* EPWM1/4/2 GPIO MUX Init */
    epwm_gpio_mux();
    /* EPWM1/4/2 Init */
    epwm_1_init();
    epwm_4_init();
    epwm_2_init();
    /* TBCLK to ePWM modules enabled */
    SysCtl_enablePeripheral(SYSCTL_PERIPH_CLK_TBCLKSYNC);

    while (1){
        // DEVICE_DELAY_US(500000);
        if(debug_on){
            pwm_setDuty(0,0,0);
        }
    }
    
}

/**
 * @brief Set PWM Duty
 *
 * @param Ua Set A phase PWM duty
 * @param Ub Set B phase PWM duty
 * @param Uc Set C phase PWM duty
 */
void svpwm_setDuty(struct foc* foc_handle)
{
    uint16_t period = foc_handle->pwm_period;
    pwm_setDuty(foc_handle->Tcm1 * period,
                foc_handle->Tcm2 * period,
                foc_handle->Tcm3 * period);
}

/**
 * @brief Get the motor mechanical radian angle
 *
 * @param foc_handle
 */
void get_RadianAngle(struct foc* foc_handle)
{
#if 0
    foc_handle->thetaELEC += 2.0 * M_PI * 125e-6 * foc_handle->motorFreq;
    foc_handle->thetaELEC = fmodf(foc_handle->thetaELEC,2 * M_PI);
    foc_handle->thetaMECH = as5600_get_angle();
#else
    foc_handle->thetaMECH = as5600_get_angle();
    foc_handle->nowClock = CPUTimer_getTimerCount(CPUTIMER0_BASE);
    foc_handle->thetaELEC = foc_handle->thetaMECH * foc_handle->motorPoles;
    foc_handle->thetaELEC = fmodf(foc_handle->thetaELEC, 2 * M_PI);
#endif
}

/**
 * @brief Get the motor three phase current Iabc
 *
 * @param foc_handle pointer to foc component handler
 */
void get_current_Iabc(struct foc* foc_handle)
{
    /* Ia Ib Ic */
    foc_handle->Iabc[0] = -(ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER5) / 4095.0f * ADC_CURRENT_SCALE - ADC_CURRENT_OFFSET);
    foc_handle->Iabc[1] = -(ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER6) / 4095.0f * ADC_CURRENT_SCALE - ADC_CURRENT_OFFSET);
    foc_handle->Iabc[2] = -(ADC_readResult(ADCARESULT_BASE, ADC_SOC_NUMBER5) / 4095.0f * ADC_CURRENT_SCALE - ADC_CURRENT_OFFSET);
}

/**
 * @brief Get the motor three phase voltage Uabc
 *
 * @param foc_handle pointer to foc component handler
 */
void get_voltage_Uabc(struct foc* foc_handle)
{
    /* Ua Ub Uc Udc */
    foc_handle->Uabc[0] = ADC_readResult(ADCBRESULT_BASE, ADC_SOC_NUMBER5) / 4095.0f * ADC_VOLTAGE_SCALE;
    foc_handle->Uabc[1] = ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER7) / 4095.0f * ADC_VOLTAGE_SCALE;
    foc_handle->Uabc[2] = ADC_readResult(ADCCRESULT_BASE, ADC_SOC_NUMBER8) / 4095.0f * ADC_VOLTAGE_SCALE;
    foc_handle->Udc     = ADC_readResult(ADCARESULT_BASE, ADC_SOC_NUMBER6) / 4095.0f * ADC_VOLTAGE_SCALE;
}

/**
 * @brief Get the motor rotation Speed
 *
 * @param foc_handle pointer to foc component handler
 */

void get_motorSpeed(struct foc* foc_handle)
{
    /* auxiliary variable */
    float auxTheta,tmpSpeed;
    uint32_t auxClock;

