henji-Guo/LAUNCHXL-F280049C/test/boostxl_3phganinv2_test.c
    /* Mechanical Angle diff */
    auxTheta = foc_handle->thetaMECH - foc_handle->thetaOLDMECH;

    /* timer diff */
    auxClock = -(foc_handle->nowClock - foc_handle->lastClock);

    /* Calculation circle number */
    if (fabsf(auxTheta) >= 0.8 * 2 * M_PI){
        foc_handle->nowTurns = (auxTheta > 0) ? foc_handle->lastTurns - 1 : foc_handle->lastTurns + 1;
        return;
    }

    float alpha = 0.01f/(0.01f + (float)(auxClock * 1e-6));
    /* calculate motor rotation speed RPM (rotation per minute) */
    tmpSpeed = ( (float)(foc_handle->nowTurns - foc_handle->lastTurns) * 2 * M_PI + auxTheta ) * 30.0f / ( auxClock * 1e-6 * M_PI );
    foc_handle->motorSpeed = alpha * foc_handle->motorSpeed + (1-alpha) * tmpSpeed;

    foc_handle->thetaOLDMECH = foc_handle->thetaMECH;
    foc_handle->lastTurns = foc_handle->nowTurns;
    foc_handle->lastClock = foc_handle->nowClock;
}

/**
 * @brief Vofa Print Data Message
 * 
 */
void vofa_print(struct vofa* vofa)
{
    uint16_t *tx_buf = (uint16_t*)&vofa->frame;
    int i;
    for (i = 0; i < VOFA_CH_COUNT * 2; i++){
        while(SciaRegs.SCIFFTX.bit.TXFFST >= 14);
        SciaRegs.SCITXBUF.bit.TXDT = tx_buf[i];
        SciaRegs.SCITXBUF.bit.TXDT = tx_buf[i] >> 8;
    }
    while(SciaRegs.SCIFFTX.bit.TXFFST >= 12);
    SciaRegs.SCITXBUF.bit.TXDT = (uint16_t)vofa->frame.tail[0];
    SciaRegs.SCITXBUF.bit.TXDT = (uint16_t)vofa->frame.tail[1];
    SciaRegs.SCITXBUF.bit.TXDT = (uint16_t)vofa->frame.tail[2];
    SciaRegs.SCITXBUF.bit.TXDT = (uint16_t)vofa->frame.tail[3];
}
